{
  "Home": "الرئيسية",
  "Categories": "الأقسام",
  "Contact US": "تواصل معنا",
  "About": "من نحن",
  "Results": "النتائج",
  "First Name": "الاسم الأول",
  "Last Name": "الاسم الأخير",
  "Mobile Number": "رقم الموبايل",
  "Email": "البريد الإلكتروني",
  "Part 1": "الجزء رقم 1",
  "Part 2": "الجزء رقم 2",
  "Part 3": "الجزء رقم 3",
  "Utilize the provided Strapi API from the assessment to post user data into your Redux store. You are required to": "استخدم واجهة برمجة التطبيقات المقدمة من تقييم Strapi لإرسال بيانات المستخدم إلى متجر Redux الخاص بك. يتعين عليك",
  "add one user into the 'users' collection and display this data in a table using a Get request. Ensure the": "إضافة مستخدم واحد إلى مجموعة 'المستخدمين' وعرض هذه البيانات في جدول باستخدام طلب Get. تأكد من",
  "implementation of Redux for state management, including both POST requests for adding a user and GET": "تنفيذ Redux لإدارة الحالة ، بما في ذلك طلبات POST لإضافة مستخدم وطلبات GET",
  "requests for displaying data in table.": "لعرض البيانات في الجدول.",
   "Implement a map using any library of your choice (leaflet is recommended). Search for the coordinates of 'Digifly": "قم بتنفيذ الخريطة باستخدام أي مكتبة تختارها (يُوصى باستخدام Leaflet). ابحث عن إحداثيات 'شركة ديجي فلاي",
  "Company' on Google Maps, then place a tooltip at these coordinates. Ensure that the tooltip styling matches the": "' على خرائط Google ، ثم ضع تلميحًا في هذه الإحداثيات. تأكد من أن تنسيق التلميح يتطابق مع",
  "provided design below.": "التصميم المقدم أدناه.",
  "Implement a text editor that precisely replicates the UI styles provided. It's essential to create the undo and redo": "قم بتنفيذ محرر نصوص يستنسخ بدقة أنماط واجهة المستخدم المقدمة. من الضروري إنشاء وظائف التراجع والإعادة",
  "functionalities from scratch, along with two additional features of choice. You may use any package, but": "من البداية ، بالإضافة إلى ميزتين إضافيتين من الاختيار. يمكنك استخدام أي حزمة ، ولكن",
  "creating these functionalities from scratch will be advantageous. Ensure that all text editor functionalities are operational.": "إنشاء هذه الوظائف من البداية سيكون مفيدًا. تأكد من أن جميع وظائف محرر النصوص تعمل بشكل صحيح.",
  "All Rights Reserved © Digifly 2024":"جميع الحقوق محفوظة © ديجي فلاي 2024",
  "DigiFly Company":"شركة ديجي فلاي",
  "Welcomes you":"ترحب بكم",
  "Send":"ارسال"
}
